Repository: gabrielovejdanie/flutter-bills
Catalog: lib/l10n/app_*.arb
Languages: ro

# appTitle
source: Bill Tracker
ro: Facturile Tale

# language
source: English
ro: Roumanian

# homeTitle
source: Bills Tracker
ro: Facturile Tale

# segmentedUnpaid
source: Unpaid
ro: Neplătite

# segmentedPaid
source: Paid
ro: Plătite

# segmentedAll
source: All
ro: Toate

# totalPerPerson
source: Per Person:
ro: Per Persoană:

source: Quantity:
ro: Cantitate :

source: Price per {unit}:
ro: Preț per {unit}:

source: Nr. of people:
ro: Număr de persoane:

source: Set to paid
ro: Platită

source: Price per person:
ro: Preț per persoană:

# lastMonthDiff
source: Last month difference:
ro: Față de luna trecută:

source: Sign Out
ro: Deconectează-te

# addBillTitle
source: Add Bill
ro: Adaugă factură

source: Bill name
ro: Numele facturii

# quantityOfUnits
source: Quantity (kW,mc) *optional
ro: Cantitate (kW, mc) *opțional

source: Total value
ro: Valoare totală

source: Number of people
ro: Număr de persoane

# unitOptional
source: Unit (kW, mc) *optional
ro: Unitate de măsură (kW, mc) *opțional

# currencyOptional
source: Currency (default lei) *optional
ro: Monedă (implicit lei) *optional

# selectMonth
source: Select month of the bill
ro: Selectează luna facturii

source: Submit
ro: Trimite

source: No bills
ro: Nu există facturi

# addBills
source: Add bill
ro: Adaugă factură

# newOrContinue
source: Add from existing
ro: Adaugă de la existente

source: New bill
ro: Adaugă nouă

# continueWithExisting
source: Create new or add from existing bills?
ro: Factură nouă sau adaugi folosind facturi existente?

# selectBills
source: Select bills to continue with
ro: Selectează facturi

source: Continue with selected
ro: Continuă cu selectate

source: New Total
ro: Total nou

source: Save
ro: Salvează

# fillAllFields
source: Please fill all fields
ro: Completați toate informațiile necesare!

# editExistingTitle
source: From existing
ro: Facturi existente

# error
source: There was a problem!
ro: A apărut o problemă!

# changesSaved
source: Changes were saved!
ro: Schimbările au fost salvate!

source: Not enough information!
ro: Sunt necesare mai multe informații!

# editBillTitle
source: Edit bill
ro: Modifică factură
